src/DataProcessors/КонтрольЗаполненностиГеоДанныхАдресаДоставкиКА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КонтрольЗаполненностиГеоДанныхАдресаДоставкиКА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>тчКА</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксРазмерСписка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытияДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Представление</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоменноеИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаБезКодов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДляСписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МенеджерыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МенеджерыТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидМенеджера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМенеджеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиОтправкиСообщенийОбОшибках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОтправкиСообщенийОбОшибках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресЭлПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветХранение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыМенеджеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Снабжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамМенеджераСнабжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамМенеджераПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючевыхКлиентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/КонтрольЗаполненностиГеоДанныхАдресаДоставкиКА/Ext/ObjectModule.bsl
Функция ПолучитьСписокКА() экспорт
	Отказ = Истина;
	
	тчКА.Очистить();
	
	Если НЕ ЗначениеЗаполнено(МаксРазмерСписка) Тогда
		МаксРазмерСписка = 100;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ АдресаДоставки
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента)
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	|	И КонтактнаяИнформация.Представление <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.Неактивный,
	|	Контрагенты.ПометкаУдаления,
	|	Контрагенты.ОсновнойДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Контрагенты.ДоступнаУслугаЭкспрессДоставки КАК ЭД,
	|	Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки КАК МаршрутДоставки,
	|	Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки2 КАК МаршрутДоставки2,
	|	Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки3 КАК МаршрутДоставки3,
	|	Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки4 КАК МаршрутДоставки4,
	|	Контрагенты.Регион.Филиал КАК Филиал,
	|	Контрагенты.Регион КАК Регион,
	|	АдресаДоставки.Представление КАК АдресДоставки,
	|	Контрагенты.Широта,
	|	Контрагенты.Долгота
	|ПОМЕСТИТЬ КА
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаДоставки КАК АдресаДоставки
	|		ПО Контрагенты.Ссылка = АдресаДоставки.Объект
	|ГДЕ
	|	Контрагенты.Ссылка В
	|			(ВЫБРАТЬ
	|				АдресаДоставки.Объект
	|			ИЗ
	|				АдресаДоставки)
	|	И Контрагенты.Неактивный = ЛОЖЬ
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.Регион <> ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	И Контрагенты.ОсновнойДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|	И (Контрагенты.ДоступнаУслугаЭкспрессДоставки = ИСТИНА
	|			ИЛИ Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки <> ЗНАЧЕНИЕ(Справочник.МаршрутыДоставки.ПустаяСсылка)
	|			ИЛИ Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки2 <> ЗНАЧЕНИЕ(Справочник.МаршрутыДоставки.ПустаяСсылка)
	|			ИЛИ Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки3 <> ЗНАЧЕНИЕ(Справочник.МаршрутыДоставки.ПустаяСсылка)
	|			ИЛИ Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки4 <> ЗНАЧЕНИЕ(Справочник.МаршрутыДоставки.ПустаяСсылка)
	|			ИЛИ Контрагенты.ОсновнаяТорговаяТочка.МаршрутДоставки5 <> ЗНАЧЕНИЕ(Справочник.МаршрутыДоставки.ПустаяСсылка))
	|	И (Контрагенты.Широта = """"
	|			ИЛИ Контрагенты.Долгота = """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МенеджерыТорговыхТочекСрезПоследних.Контрагент,
	|	МенеджерыТорговыхТочекСрезПоследних.ВидМенеджера,
	|	МенеджерыТорговыхТочекСрезПоследних.Менеджер
	|ПОМЕСТИТЬ Менеджеры
	|ИЗ
	|	РегистрСведений.МенеджерыТорговыхТочек.СрезПоследних КАК МенеджерыТорговыхТочекСрезПоследних
	|ГДЕ
	|	МенеджерыТорговыхТочекСрезПоследних.ВидМенеджера = ЗНАЧЕНИЕ(Перечисление.ВидыМенеджеров.Продажи)
	|	И МенеджерыТорговыхТочекСрезПоследних.Контрагент В
	|			(ВЫБРАТЬ
	|				КА.Ссылка
	|			ИЗ
	|				КА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ " + СокрЛП(Формат(МаксРазмерСписка,"ЧЦ=15; ЧДЦ=0; ЧГ=0")) + "
	|	КА.Ссылка,
	|	Менеджеры.Менеджер КАК Менеджер,
	|	КА.Филиал,
	|	КА.Регион,
	|	КА.АдресДоставки,
	|	КА.Неактивный,
	|	КА.ПометкаУдаления,
	|	КА.ВидДоговора,
	|	КА.ЭД,
	|	КА.МаршрутДоставки,
	|	КА.МаршрутДоставки2,
	|	КА.МаршрутДоставки3,
	|	КА.МаршрутДоставки4,
	|	КА.Широта,
	|	КА.Долгота,
	|	КА.Наименование

	|ИЗ
	|	КА КАК КА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Менеджеры КАК Менеджеры
	|		ПО КА.Ссылка = Менеджеры.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	КА.Филиал,
	|	КА.Регион,
	|	КА.Наименование";

	тчКА = Запрос.Выполнить().Выгрузить();
	Отказ = Ложь;
	
	Возврат Отказ;
КонецФункции
Функция ВыполнитьОповещение() Экспорт
	
	Отказ = Истина;
	
	ТекстПосылки = "Всего выявлено [" + СокрЛП(тчКА.Количество()) + "] КА, которым нужно заполнить Широту/Долготу";
	сч = 0;
	Для каждого стр из тчКА цикл
		
		сч = сч + 1;
		
		тСтр = СокрЛП(сч) + ";" +
			   СокрЛП(стр.Ссылка.УникальныйИдентификатор()) + ";" +
			   СокрЛП(стр.Наименование) + ";" +
			   СокрЛП(стр.Филиал) + ";" +
			   СокрЛП(стр.Менеджер) + ";" +
			   СокрЛП(стр.АдресДоставки) + ";";
		
		ТекстПосылки = ТекстПосылки + Символы.ПС + тСтр;
		
	КонецЦикла;
	
	СписокАдресатов = ПолучитьСписокАдресовРассылки();
	
	РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(ВидСобытияДляОповещения,ТекстПосылки,?(тчКА.Количество() > 0,"err:","inf:") + " Контроль заполненности геоданных",СписокАдресатов);
	
	Отказ = Ложь;
	
	Возврат Отказ;
КонецФункции

Процедура ПолучитьВидСобытияОповещения() Экспорт
	
	Если ЗначениеЗаполнено(ВидСобытияДляОповещения) Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		ВидСобытияДляОповещения = Справочники.СобытияДляОтправкиЭлектронныхПисем.КонтрольЗаполненностиГеоДанныхАдресаДоставкиКА;
	Исключение
		ВидСобытияДляОповещения = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОбменаССайтом;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСписокАдресовРассылки() Экспорт
	
	ПолучитьВидСобытияОповещения();
	
	СписокАдресатов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиОтправкиСообщенийОбОшибках.Пользователь,
	|	НастройкиОтправкиСообщенийОбОшибках.АдресЭлПочты
	|ИЗ
	|	РегистрСведений.НастройкиОтправкиСообщенийОбОшибках КАК НастройкиОтправкиСообщенийОбОшибках
	|ГДЕ
	|	НастройкиОтправкиСообщенийОбОшибках.Событие = &Событие
	|	И НастройкиОтправкиСообщенийОбОшибках.Настройка = Истина";

	Запрос.УстановитьПараметр("Событие", ВидСобытияДляОповещения);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АдресЭлПочты");

	Если Результат.Количество() > 0 Тогда
		СписокАдресатов.ЗагрузитьЗначения(Результат);
	Иначе
		СписокАдресатов.Добавить("Pushkin-DS@Part-kom.ru", "Пушкин Денис");
	КонецЕсли;
	
	Возврат СписокАдресатов;
КонецФункции	

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ПолучитьСписокКА();
	ВыполнитьОповещение();
	
КонецПроцедуры
